In [1]:
import numpy as np 
import pandas as pd

In [2]:
# 生成日期的索引的DataFrame
dates = pd.date_range('20130101', periods=6)

In [3]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# 使用dates 创建一个DataFrame结构表
df = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))

In [6]:
df

                   A         B         C         D
2013-01-01  0.596729  0.155664 -0.892702 -0.267331
2013-01-02  1.218386  0.798494 -0.157512 -1.186164
2013-01-03 -0.622531  0.103558  0.686371  0.858923
2013-01-04 -1.772739  1.802870 -0.986180 -0.235148
2013-01-05  0.509763 -0.314481 -0.126685 -0.607840
2013-01-06  0.615958  0.541645  0.503247  1.706209

In [7]:
# 查看DataFrame头部
df.head()

                   A         B         C         D
2013-01-01  0.596729  0.155664 -0.892702 -0.267331
2013-01-02  1.218386  0.798494 -0.157512 -1.186164
2013-01-03 -0.622531  0.103558  0.686371  0.858923
2013-01-04 -1.772739  1.802870 -0.986180 -0.235148
2013-01-05  0.509763 -0.314481 -0.126685 -0.607840

In [9]:
# 通过给定参数 查看DataFrame尾部往上几行
df.tail(1)

                   A         B         C         D
2013-01-06  0.615958  0.541645  0.503247  1.706209

In [11]:
# 显示索引与列明
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
# 按轴排序
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.267331 -0.892702  0.155664  0.596729
2013-01-02 -1.186164 -0.157512  0.798494  1.218386
2013-01-03  0.858923  0.686371  0.103558 -0.622531
2013-01-04 -0.235148 -0.986180  1.802870 -1.772739
2013-01-05 -0.607840 -0.126685 -0.314481  0.509763
2013-01-06  1.706209  0.503247  0.541645  0.615958

In [14]:
# 按值排序
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.509763 -0.314481 -0.126685 -0.607840
2013-01-03 -0.622531  0.103558  0.686371  0.858923
2013-01-01  0.596729  0.155664 -0.892702 -0.267331
2013-01-06  0.615958  0.541645  0.503247  1.706209
2013-01-02  1.218386  0.798494 -0.157512 -1.186164
2013-01-04 -1.772739  1.802870 -0.986180 -0.235148

In [15]:
# 用标签提取一行
df.loc[dates[0]]

A    0.596729
B    0.155664
C   -0.892702
D   -0.267331
Name: 2013-01-01 00:00:00, dtype: float64

In [16]:
# 用整数位置选择
df.iloc[3]

A   -1.772739
B    1.802870
C   -0.986180
D   -0.235148
Name: 2013-01-04 00:00:00, dtype: float64

In [17]:
# 用整数切片
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.772739  1.802870
2013-01-05  0.509763 -0.314481

In [18]:
# 用整数列表按位置切片
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.218386 -0.157512
2013-01-03 -0.622531  0.686371
2013-01-05  0.509763 -0.126685

In [19]:
# 用isin 筛选
df2 = df.copy()

In [20]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [21]:
df2

                   A         B         C         D      E
2013-01-01  0.596729  0.155664 -0.892702 -0.267331    one
2013-01-02  1.218386  0.798494 -0.157512 -1.186164    one
2013-01-03 -0.622531  0.103558  0.686371  0.858923    two
2013-01-04 -1.772739  1.802870 -0.986180 -0.235148  three
2013-01-05  0.509763 -0.314481 -0.126685 -0.607840   four
2013-01-06  0.615958  0.541645  0.503247  1.706209  three

In [23]:
# 用索引自动对齐新增列的数据
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

#### 缺失值

In [26]:
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [28]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C         D    E
2013-01-01  0.596729  0.155664 -0.892702 -0.267331  1.0
2013-01-02  1.218386  0.798494 -0.157512 -1.186164  1.0
2013-01-03 -0.622531  0.103558  0.686371  0.858923  NaN
2013-01-04 -1.772739  1.802870 -0.986180 -0.235148  NaN

In [29]:
# 删除所含缺失行
df1.dropna(how = 'any')

                   A         B         C         D    E
2013-01-01  0.596729  0.155664 -0.892702 -0.267331  1.0
2013-01-02  1.218386  0.798494 -0.157512 -1.186164  1.0

In [30]:
# 填充缺失值
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.596729  0.155664 -0.892702 -0.267331  1.0
2013-01-02  1.218386  0.798494 -0.157512 -1.186164  1.0
2013-01-03 -0.622531  0.103558  0.686371  0.858923  5.0
2013-01-04 -1.772739  1.802870 -0.986180 -0.235148  5.0

In [32]:
# 提取nan值的布尔掩码
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

### 运算

In [33]:
# 统计
df.mean()   # 默认行轴

A    0.090928
B    0.514625
C   -0.162244
D    0.044775
dtype: float64

In [34]:
df.mean(1)   # 传1从列执行

2013-01-01   -0.101910
2013-01-02    0.168301
2013-01-03    0.256580
2013-01-04   -0.297799
2013-01-05   -0.134811
2013-01-06    0.841765
Freq: D, dtype: float64

In [35]:
# 不同维度矩阵运算时，要先对齐，pandas自动眼指定维度广播
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [36]:
df.sub(s,axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -1.622531 -0.896442 -0.313629 -0.141077
2013-01-04 -4.772739 -1.197130 -3.986180 -3.235148
2013-01-05 -4.490237 -5.314481 -5.126685 -5.607840
2013-01-06       NaN       NaN       NaN       NaN

In [37]:
# 使用apply函数处理
df.apply(np.cumsum)
df.apply(lambda x : x.max()-x.min())

A    2.991125
B    2.117351
C    1.672550
D    2.892373
dtype: float64

In [38]:
# 直方图
s.value_counts()

5.0    1
3.0    1
1.0    1
dtype: int64

In [39]:
# 合并
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.934951 -0.138619  0.754496 -0.014006
1 -0.625121 -1.551745 -0.567218  0.768938
2 -0.081623  1.167110  0.381244 -0.473598
3  0.827969 -0.604415  0.308943  0.200829
4  0.566260  0.060526 -2.048739 -0.925572
5 -0.947316 -0.354689  1.119897  0.215655
6  0.038481 -0.143019 -1.464743 -0.553149
7 -0.658818 -3.166022 -1.088048 -0.324140
8  0.841670  0.892295  0.314261 -0.307853
9  0.710284 -0.259830  0.031063  0.012712

In [40]:
pieces = [df[:3],df[3:7],df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.934951 -0.138619  0.754496 -0.014006
1 -0.625121 -1.551745 -0.567218  0.768938
2 -0.081623  1.167110  0.381244 -0.473598
3  0.827969 -0.604415  0.308943  0.200829
4  0.566260  0.060526 -2.048739 -0.925572
5 -0.947316 -0.354689  1.119897  0.215655
6  0.038481 -0.143019 -1.464743 -0.553149
7 -0.658818 -3.166022 -1.088048 -0.324140
8  0.841670  0.892295  0.314261 -0.307853
9  0.710284 -0.259830  0.031063  0.012712

In [41]:
# 连接
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [43]:
left
right

   key  rval
0  foo     4
1  foo     5

In [44]:
# 合并，连接
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [45]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [46]:
df

          A         B         C         D
0 -0.487097  0.388075 -0.306541 -0.647139
1  0.241464  0.292056  0.212821  0.128514
2  0.961516  0.229450 -0.092110  1.055930
3  0.988769 -0.597192 -0.056658  0.208321
4  0.923835 -1.989118  1.750771 -0.792511
5  0.299409 -0.884310 -0.536969  0.281493
6  0.106342 -1.038882 -0.666907 -0.384004
7  1.282349  0.306765 -0.622302 -0.328507

In [47]:
s = df.iloc[3]

In [48]:
# 追加一行
df.append(s,ignore_index=True)

          A         B         C         D
0 -0.487097  0.388075 -0.306541 -0.647139
1  0.241464  0.292056  0.212821  0.128514
2  0.961516  0.229450 -0.092110  1.055930
3  0.988769 -0.597192 -0.056658  0.208321
4  0.923835 -1.989118  1.750771 -0.792511
5  0.299409 -0.884310 -0.536969  0.281493
6  0.106342 -1.038882 -0.666907 -0.384004
7  1.282349  0.306765 -0.622302 -0.328507
8  0.988769 -0.597192 -0.056658  0.208321

In [49]:
# 分组 #狭隘难条件把数据分割成多组
# 为每组单独应用函数
# 将处理结果组合成一个数据结构
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                            'foo', 'bar', 'foo', 'foo'],
                      'B': ['one', 'one', 'two', 'three',
                            'two', 'two', 'one', 'three'],
                      'C': np.random.randn(8),
                     'D': np.random.randn(8)})

In [50]:
df

     A      B         C         D
0  foo    one  0.036197 -0.637231
1  bar    one -0.902412  0.507719
2  foo    two  0.274994 -0.274639
3  bar  three -1.155290  1.090771
4  foo    two -0.400854  0.123223
5  bar    two  0.801214 -0.314595
6  foo    one -0.304889  1.228144
7  foo  three -1.299547  0.616991

In [51]:
df.groupby('A').sum()

            C         D
A
bar -1.256487  1.283895
foo -1.694098  1.056488

In [52]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.902412  0.507719
    three -1.155290  1.090771
    two    0.801214 -0.314595
foo one   -0.268691  0.590914
    three -1.299547  0.616991
    two   -0.125860 -0.151416

In [53]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                      'D': np.random.randn(12),
                       'E': np.random.randn(12)})

In [54]:
df

        A  B    C         D         E
0     one  A  foo -0.830664  1.049362
1     one  B  foo  1.762329 -1.576070
2     two  C  foo -0.796718  0.962589
3   three  A  bar -0.281681 -1.298845
4     one  B  bar  1.157845 -0.110901
5     one  C  bar -0.135885 -0.651087
6     two  A  foo -0.616154 -1.173149
7   three  B  foo  0.016453 -1.584004
8     one  C  foo -0.594829 -2.380003
9     one  A  bar  2.456546 -1.259552
10    two  B  bar -1.654196 -0.577134
11  three  C  bar  1.903889 -0.375551

In [55]:
pd.pivot_table(df,values='D', index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A  2.456546 -0.830664
      B  1.157845  1.762329
      C -0.135885 -0.594829
three A -0.281681       NaN
      B       NaN  0.016453
      C  1.903889       NaN
two   A       NaN -0.616154
      B -1.654196       NaN
      C       NaN -0.796718